wambd/certification2/selectRQ.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pac="http://packages.servicePackage.dome.com/">
<soapenv:Header/>
<soapenv:Body>
   <pac:select>
      <arg0>
         <!--addPostNights>1</addPostNights-->
         <!--addPreNights>2</addPreNights-->
         <!--El campo "distribution" es obligatorio-->
         <distribution>
            <distributionId>1</distributionId>
            <pax>
               <age>30</age>
               <documentNumber></documentNumber>
               <firstName>NOMBRETESTA1</firstName>
               <lastName>APELLIDOTESTA1</lastName>
               <paxId>1</paxId>
               <phone></phone>
            </pax>
            <pax>
               <age>35</age>
               <documentNumber></documentNumber>
               <firstName>NOMBRETESTA2</firstName>
               <lastName>APELLIDOTESTA2</lastName>
               <paxId>2</paxId>
               <phone></phone>
            </pax>      
        </distribution>
        <distribution>
            <distributionId>2</distributionId>
            <pax>
               <age>40</age>
               <documentNumber></documentNumber>
               <firstName>NOMBRETESTA3</firstName>
               <lastName>APELLIDOTESTA3</lastName>
               <paxId>3</paxId>
               <phone></phone>
            </pax>
            <pax>
               <age>39</age>
               <documentNumber></documentNumber>
               <firstName>NOMBRETESTA4</firstName>
               <lastName>APELLIDOTESTA4</lastName>
               <paxId>4</paxId>
               <phone></phone>
            </pax>   
         </distribution>

         <!--El campo "ideses" es obligatorio-->
         <ideses>WAW#40292#219180234658010</ideses>
         <optionalServiceId>9-1/9-1</optionalServiceId>
         
         <!--El campo "serviceGroupId" es obligatorio-->
         <serviceGroupId>2-1111295/4/3</serviceGroupId>
      </arg0>
   </pac:select>
</soapenv:Body>
</soapenv:Envelope>